Revit 2027 API
SketchPlane.GetPlaneReference Method
 Returns a reference to this element as a plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetPlaneReference()
Public Function GetPlaneReference As Reference
public:
Reference^ GetPlaneReference()
member GetPlaneReference : unit -> Reference
Return Value
Reference
 The reference.
Remarks
 The object returned here can be used with the PointOnPlane class.
See Also
Reference
SketchPlane Class
Autodesk.Revit.DB Namespace